[Language]
Main_Title=Grazie per aver scelto EaseUS Data Recovery Wizard
Sub_Title=Complessivamente come valuteresti la tua esperienza?
Terrible=Pessimo
Poor=Scarso
Good=Buono
Great=Molto Buono
Excellent=Eccellente
Never_Ask_Again=Non chiedere mai più
Rate_Now=Vota Ora
Feedback_Text_Tips=Si prega di lasciare il feedback quì.
Feedback_Length_Tips=Ha inserito più di 500 parole. Si prega di inviarci il feedback a support@easeus.com
